//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1987-2013, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************

//**********************************************************************
//<AMI_FHDR_START>
//
// Name:	CPU.uni
//
// Description:	CPU unicode description.
//
//<AMI_FHDR_END>
//**********************************************************************
/=#
#include "VFR.uni"

//
// CPU Configuration
//
#string STR_CPU_FORM                    #language eng "CPU Configuration"
#string STR_CPU_FORM_HELP               #language eng "CPU Configuration Parameters"

#string STR_CPU_SKT0_FORM               #language eng "Socket 0 CPU Information"
#string STR_CPU_SKT1_FORM               #language eng "Socket 1 CPU Information"
#string STR_CPU_SKT2_FORM               #language eng "Socket 2 CPU Information"
#string STR_CPU_SKT3_FORM               #language eng "Socket 3 CPU Information"
#string STR_CPU_SKT_FORM_HELP           #language eng "Socket specific CPU Information"

#string STR_CPU_SKT_NOT_PRESENT_HELP    #language eng "CPU not present"
#string STR_CPU_SKT_NOT_PRESENT_VALUE   #language eng "Not Present"
#string STR_CPU_SKT0_NOT_PRESENT_STRING #language eng "Socket 0"
#string STR_CPU_SKT1_NOT_PRESENT_STRING #language eng "Socket 1"
#string STR_CPU_SKT2_NOT_PRESENT_STRING #language eng "Socket 2"
#string STR_CPU_SKT3_NOT_PRESENT_STRING #language eng "Socket 3"

#string STR_CPU_MISMATCH_STRING         #language eng "Mismatch CPU"
#string STR_CPU_MISMATCH_VALUE          #language eng "Unsupported installed CPU combination."

#string STR_PROCESSOR_VERSION_STRING    #language eng "CPU Type"
#string STR_CPU_SKT0_VERSION_VALUE      #language eng ""
#string STR_CPU_SKT1_VERSION_VALUE      #language eng ""
#string STR_CPU_SKT2_VERSION_VALUE      #language eng ""
#string STR_CPU_SKT3_VERSION_VALUE      #language eng ""

#string STR_CPU_SKT_MAXSPEED_STRING     #language eng "Max CPU Speed"
#string STR_CPU_SKT_MAXSPEED_HELP       #language eng "Displays the Max CPU Speed"
#string STR_CPU_SKT0_MAXSPEED_VALUE     #language eng ""
#string STR_CPU_SKT1_MAXSPEED_VALUE     #language eng ""
#string STR_CPU_SKT2_MAXSPEED_VALUE     #language eng ""
#string STR_CPU_SKT3_MAXSPEED_VALUE     #language eng ""

#string STR_CPU_SKT_MINSPEED_STRING     #language eng "Min CPU Speed"
#string STR_CPU_SKT_MINSPEED_HELP       #language eng "Displays the Max CPU Speed"
#string STR_CPU_SKT0_MINSPEED_VALUE     #language eng ""
#string STR_CPU_SKT1_MINSPEED_VALUE     #language eng ""
#string STR_CPU_SKT2_MINSPEED_VALUE     #language eng ""
#string STR_CPU_SKT3_MINSPEED_VALUE     #language eng ""

#string STR_PROCESSOR_SPEED_STRING      #language eng "CPU Speed"
#string STR_PROCESSOR_SPEED_VALUE       #language eng ""
#string STR_PROCESSOR_SPEED_HELP        #language eng "Displays the CPU Speed"

#string STR_CPU_SKT_L1_DATA_CACHE_STRING    #language eng "L1 Data Cache"
#string STR_CPU_SKT_L1_DATA_CACHE_HELP      #language eng "L1 Data Cache Size"
#string STR_CPU_SKT0_L1_DATA_CACHE_VALUE    #language eng "Not Present"
#string STR_CPU_SKT1_L1_DATA_CACHE_VALUE    #language eng "Not Present"
#string STR_CPU_SKT2_L1_DATA_CACHE_VALUE    #language eng "Not Present"
#string STR_CPU_SKT3_L1_DATA_CACHE_VALUE    #language eng "Not Present"

#string STR_CPU_SKT_L1_CODE_CACHE_STRING    #language eng "L1 Code Cache"
#string STR_CPU_SKT_L1_CODE_CACHE_HELP      #language eng "L1 Code Cache Size"
#string STR_CPU_SKT0_L1_CODE_CACHE_VALUE    #language eng "Not Present"
#string STR_CPU_SKT1_L1_CODE_CACHE_VALUE    #language eng "Not Present"
#string STR_CPU_SKT2_L1_CODE_CACHE_VALUE    #language eng "Not Present"
#string STR_CPU_SKT3_L1_CODE_CACHE_VALUE    #language eng "Not Present"

#string STR_CPU_SKT_L2_CACHE_STRING        #language eng "L2 Cache"
#string STR_CPU_SKT_L2_CACHE_HELP          #language eng "L2 Cache Size"
#string STR_CPU_SKT0_L2_CACHE_VALUE        #language eng "Not Present"
#string STR_CPU_SKT1_L2_CACHE_VALUE        #language eng "Not Present"
#string STR_CPU_SKT2_L2_CACHE_VALUE        #language eng "Not Present"
#string STR_CPU_SKT3_L2_CACHE_VALUE        #language eng "Not Present"

#string STR_CPU_SKT_L3_CACHE_STRING        #language eng "L3 Cache"
#string STR_CPU_SKT_L3_CACHE_HELP          #language eng "L3 Cache Size"
#string STR_CPU_SKT0_L3_CACHE_VALUE        #language eng "Not Present"
#string STR_CPU_SKT1_L3_CACHE_VALUE        #language eng "Not Present"
#string STR_CPU_SKT2_L3_CACHE_VALUE        #language eng "Not Present"
#string STR_CPU_SKT3_L3_CACHE_VALUE        #language eng "Not Present"

#string STR_CPU_SKT_NUMCORE_STRING      #language eng "Processor Cores"
#string STR_CPU_SKT_NUMCORE_HELP        #language eng "Displays number of cores."
#string STR_CPU_SKT0_NUMCORE_VALUE      #language eng "0"
#string STR_CPU_SKT1_NUMCORE_VALUE      #language eng "0"
#string STR_CPU_SKT2_NUMCORE_VALUE      #language eng "0"
#string STR_CPU_SKT3_NUMCORE_VALUE      #language eng "0"

#string STR_CPU_SKT_HT_STRING           #language eng "Intel HT Technology"
#string STR_CPU_SKT_HT_HELP             #language eng "When Hyper-threading is enabled, 2 logical CPUS per core is present."
#string STR_CPU_SKT0_HT_VALUE           #language eng "Not Supported"
#string STR_CPU_SKT1_HT_VALUE           #language eng "Not Supported"
#string STR_CPU_SKT2_HT_VALUE           #language eng "Not Supported"
#string STR_CPU_SKT3_HT_VALUE           #language eng "Not Supported"

#string STR_CPU_SKT_VTX_STRING          #language eng "Intel VT-x Technology"
#string STR_CPU_SKT_VTX_HELP            #language eng "CPU VMX hardware support for virtual machines."
#string STR_CPU_SKT0_VTX_VALUE          #language eng "Not Supported"
#string STR_CPU_SKT1_VTX_VALUE          #language eng "Not Supported"
#string STR_CPU_SKT2_VTX_VALUE          #language eng "Not Supported"
#string STR_CPU_SKT3_VTX_VALUE          #language eng "Not Supported"

#string STR_CPU_SKT_SMX_STRING          #language eng "Intel SMX Technology"
#string STR_CPU_SKT_SMX_HELP            #language eng "Secure Mode extensions support."
#string STR_CPU_SKT0_SMX_VALUE          #language eng "Not Supported"
#string STR_CPU_SKT1_SMX_VALUE          #language eng "Not Supported"
#string STR_CPU_SKT2_SMX_VALUE          #language eng "Not Supported"
#string STR_CPU_SKT3_SMX_VALUE          #language eng "Not Supported"

#string STR_CPU_EMT64_HELP              #language eng "Displays if 64-bit supported"
#string STR_CPU_EMT64_STRING            #language eng "64-bit"
#string STR_CPU_EMT64_VALUE             #language eng "Supported"

// Do not translate the following!  The name is trademarked.
#string STR_PROCESSOR_HT_MODE           #language eng "Hyper Threading  Technology"
#string STR_PROCESSOR_HT_MODE_HELP      #language eng "Select Disabled if your operating system is Windows 2000"

#string STR_CPU_SKT_MICROCODE_STRING    #language eng "Microcode Patch"
#string STR_CPU_SKT_MICROCODE_HELP      #language eng "CPU Microcode Patch Revision"
#string STR_CPU_SKT0_MICROCODE_VALUE    #language eng "Not loaded"
#string STR_CPU_SKT1_MICROCODE_VALUE    #language eng "Not loaded"
#string STR_CPU_SKT2_MICROCODE_VALUE    #language eng "Not loaded"
#string STR_CPU_SKT3_MICROCODE_VALUE    #language eng "Not loaded"

#string STR_CPU_SKT_CPUID_STRING        #language eng "CPU Signature"
#string STR_CPU_SKT_CPUID_HELP          #language eng "Displays CPU Signature"
#string STR_CPU_SKT0_CPUID_VALUE        #language eng ""
#string STR_CPU_SKT1_CPUID_VALUE        #language eng ""
#string STR_CPU_SKT2_CPUID_VALUE        #language eng ""
#string STR_CPU_SKT3_CPUID_VALUE        #language eng ""

#string STR_BSP_SELECT_PROMPT           #language eng "BSP Select"
#string STR_BSP_SELECT_PROMPT_HELP      #language eng "User selects which core is BSP."

#string STR_CPU_XD_BIT_PROMPT           #language eng "Execute Disable Bit"
#string STR_CPU_XD_BIT_PROMPT_HELP      #language eng "XD can prevent certain classes of malicious buffer overflow attacks when combined with a supporting OS (Windows Server 2003 SP1, Windows XP SP2, SuSE Linux 9.2, RedHat Enterprise 3 Update 3.)"

#string STR_CPU_HTD_PROMPT              #language eng "Hyper-threading"
#string STR_CPU_HTD_PROMPT_HELP         #language eng "Enabled for Windows XP and Linux (OS optimized for Hyper-Threading Technology) and Disabled for other OS (OS not optimized for Hyper-Threading Technology). When Disabled only one thread per enabled core is enabled." 

#string STR_CPU_1					    #language eng "1"
#string STR_CPU_2					    #language eng "2"
#string STR_CPU_3					    #language eng "3"
#string STR_CPU_4					    #language eng "4"
#string STR_CPU_5					    #language eng "5"
#string STR_CPU_6					    #language eng "6"
#string STR_CPU_7					    #language eng "7"
#string STR_CPU_8					    #language eng "8"
#string STR_CPU_9					    #language eng "9"
#string STR_CPU_ALL					    #language eng "All"

#string STR_CPU_ACTIVE_CORE_COUNT_PROMPT        #language eng "Active Processor Cores"
#string STR_CPU_ACTIVE_CORE_COUNT_PROMPT_HELP   #language eng "Number of cores to enable in each processor package." 
#string STR_CPU_EX_ACTIVE_CORE_COUNT_PROMPT_HELP #language eng "Each bit position represents a core to be enable in each procesor package."

#string STR_CPU_LIMIT_CPUID_MAX_PROMPT		#language eng "Limit CPUID Maximum"
#string STR_CPU_LIMIT_CPUID_MAX_PROMPT_HELP	#language eng "Disabled for Windows XP"

#string STR_PROC_HW_PREFETCH_PROMPT		    #language eng "Hardware Prefetcher"
#string STR_PROC_HW_PREFETCH_PROMPT_HELP	#language eng "Enable the Mid Level Cache (L2) streamer prefetcher."

#string STR_PROC_ADJ_CACHE_LINE_PROMPT		#language eng "Adjacent Cache Line Prefetch"
#string STR_PROC_ADJ_CACHE_LINE_PROMPT_HELP	#language eng "Enable the Mid Level Cache (L2) prefetching of adjacent cache lines."

#string STR_CPU_DCU_STREAMER_PREFETCH_PROMPT      #language eng "L1 Data Prefetcher"
#string STR_CPU_DCU_STREAMER_PREFETCH_PROMPT_HELP #language eng "Enable/Disable L1 Data Prefetcher"

//#string STR_CPU_L1_DATA_PREFETCH_PROMPT      #language eng "L1 Data Prefetcher"
//#string STR_CPU_L1_DATA_PREFETCH_PROMPT_HELP #language eng "Enable/Disable L1 Data Prefetcher"

#string STR_CPU_DATA_REUSE_PROMPT           #language eng "Data Reuse Optimization"
#string STR_CPU_DATA_REUSE_PROMPT_HELP      #language eng "Data Reuse Performance Optimization"

//#string STR_CPU_TM_PROMPT                   #language eng "TM support"
//#string STR_CPU_TM_PROMPT_HELP              #language eng "Enable CPU thermal management"

#string STR_CPU_VT_PROMPT			#language eng "Intel Virtualization Technology"
#string STR_CPU_VT_PROMPT_HELP		#language eng "When enabled, a VMM can utilize the additional hardware capabilities provided by Vanderpool Technology"

//#string STR_CPU_BSP_SELECT_PROMPT           #language eng "BSP Select"
//#string STR_CPU_BSP_SELECT_PROMPT_HELP      #language eng "Select the BSP"
//#string STR_CPU_BSP_SELECT_AUTO             #language eng "AUTO"
//#string STR_CPU_BSP_SELECT_0                #language eng "CPU 0"
//#string STR_CPU_BSP_SELECT_1                #language eng "CPU 1"

//#string STR_CPU_PSD_COORD_TYPE_PROMPT       #language eng "P-STATE Coordination"
//#string STR_CPU_PSD_COORD_TYPE_PROMPT_HELP  #language eng "Change P-STATE Coordination type"
//#string STR_CPU_PSD_HW_ALL                  #language eng "HW_ALL"
//#string STR_CPU_PSD_SW_ALL                  #language eng "SW_ALL"
//#string STR_CPU_PSD_SW_ANY                  #language eng "SW_ANY"

#string STR_CPU_LOCAL_X2_APIC_PROMPT        #language eng "Local x2APIC"
#string STR_CPU_LOCAL_X2_APIC_PROMPT_HELP   #language eng "Enable Local x2APIC. Some OSes do not support this"

#string STR_ITXT_PROMPT     #language eng "Intel TXT(LT) Support"
#string STR_ITXT_SUPPORT_HELP   #language eng "Enables or Disables Intel(R) TXT(LT) support."

#string STR_DTS_PROMPT         #language eng "CPU DTS"
#string STR_DTS_HELP           #language eng "Disabled: ACPI thermal management uses EC reported temperature values.\nEnabled: ACPI thermal management uses DTS SMM mechanism to obtain CPU temperature values.\nOut of Spec: ACPI Thermal Management uses EC reported temperature values and DTS SMM is used to handle Out of Spec condition."

#string STR_DEBUG_INTERFACE_PROMPT           #language eng "Debug Interface"
#string STR_DEBUG_INTERFACE_PROMPT_HELP      #language eng "Enable/Disable Cpu debug feature."

#string STR_DEBUG_INTERFACE_LOCK_PROMPT           #language eng "Debug Interface Lock"
#string STR_DEBUG_INTERFACE_LOCK_PROMPT_HELP      #language eng "Lock Cpu debug feature setting."

#string STR_CPU_ENABLED                     #language eng "Enabled"
#string STR_CPU_DISABLED                    #language eng "Disabled"

#string STR_PROCESSOR_FAMILY_STRING		#language eng "Processor Family"
#string STR_PROCESSOR_FAMILY_HELP		#language eng "Displays the processor family"
#string STR_PROCESSOR_FAMILY_VALUE		#language eng ""

#string STR_CPU_SKT_FSBSPEED_STRING		#language eng "FSB Speed"
#string STR_CPU_SKT_FSBSPEED_HELP		#language eng "Displays the FSB speed"
#string STR_CPU_SKT_FSBSPEED_VALUE		#language eng "100 MHz"

//#string <string name> #language eng ""

//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1987-2013, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************
